* Question
Exercise 3.69 discussed how to generate the stream of all Pythagorean triples, with no upper bound on the size of the integers to be searched. Explain why simply replacing ~an-integer-between~ by ~an-integer-starting-from~ in the procedure in exercise 4.35 is not an adequate way to generate arbitrary Pythagorean triples. Write a procedure that actually will accomplish this. (That is, write a procedure for which repeatedly typing ~try-again~ would in principle eventually generate all Pythagorean triples.)

* Answer
Switching all three variables to ~an-integer-starting-from~ will cause the procedure to get stuck backtracking ~k~ for $i = 1$ and $j = 2$.

#+begin_src scheme :results output :exports both
  ;; Load
  (load "4.ambeval.scm")

  ;; Answer
  (define answer
    '(define (all-pythagorean-triples)
       (let ((k (an-integer-starting-from 1)))
         (let ((j (an-integer-between 1 k)))
           (let ((i (an-integer-between 1 j)))
             (require (= (+ (* i i) (* j j)) (* k k)))
             (list i j k))))))

  ;; Test
  (mc-eval answer)
  (map print
       (mc-eval '(all-pythagorean-triples)))
#+end_src

#+RESULTS:
: (3 4 5)
: (6 8 10)
: (5 12 13)
: (9 12 15)
: (8 15 17)
: ...
